#region tests
Перем КонтекстЯдра;
Перем Ожидаем;

Перем обработка;


Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.НачатьГруппу("Проверка");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьПроверку");
	НаборТестов.НачатьГруппу("Одиночные парсеры");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьПроверку_char_pos");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьПроверку_char_neg");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьПроверку_ichar_pos");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьПроверку_ichar_neg");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
	ФайлТеста = Новый Файл(ЭтотОбъект.ИспользуемоеИмяФайла);
	ФайлОбработки = ФайлТеста.Путь + "..\rikiPEG.epf";
	
	Обработка = ВнешниеОбработки.Создать(ФайлОбработки, Ложь);
	
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ТестДолжен_ВыполнитьПроверку() Экспорт
	
	Ожидаем.Что(Обработка.testCheck(),"Обработка корректно подключилась").Равно(1);
	
КонецПроцедуры

#EndRegion




Процедура ТестДолжен_ВыполнитьПроверку_char_pos() Экспорт
	
	обработка.addParser("test", обработка.matchChar("б"));
	result = обработка.apply("болт", "test");
	Ожидаем.Что(result.result,"Корректно прочли символ").Равно("б");
	Ожидаем.Что(result.state.column).Равно(2);
	Ожидаем.Что(result.state.pos).Равно(1);
	Ожидаем.Что(result.state.line).Равно(1);
	Ожидаем.Что(result.succes).Равно(Истина);
	
	
КонецПроцедуры


Процедура ТестДолжен_ВыполнитьПроверку_char_neg() Экспорт
	
	обработка.addParser("test", обработка.matchChar("б"));
	result = обработка.apply("олт", "test");
	Ожидаем.Что(result.state.column).Равно(1);
	Ожидаем.Что(result.state.pos).Равно(0);
	Ожидаем.Что(result.state.line).Равно(1);
	Ожидаем.Что(result.succes).Равно(ложь);
	
	
КонецПроцедуры

Процедура ТестДолжен_ВыполнитьПроверку_ichar_pos() Экспорт
	
	обработка.addParser("test", обработка.matchiChar("б"));
	result = обработка.apply("Болт", "test");
	Ожидаем.Что(result.result,"Корректно прочли символ").Равно("Б");
	Ожидаем.Что(result.state.column).Равно(2);
	Ожидаем.Что(result.state.pos).Равно(1);
	Ожидаем.Что(result.state.line).Равно(1);
	Ожидаем.Что(result.succes).Равно(Истина);
	
	обработка.addParser("test", обработка.matchiChar("б"));
	result = обработка.apply("болт", "test");
	Ожидаем.Что(result.result,"Корректно прочли символ").Равно("б");
	Ожидаем.Что(result.state.column).Равно(2);
	Ожидаем.Что(result.state.pos).Равно(1);
	Ожидаем.Что(result.state.line).Равно(1);
	Ожидаем.Что(result.succes).Равно(Истина);
	
КонецПроцедуры


Процедура ТестДолжен_ВыполнитьПроверку_ichar_neg() Экспорт
	
	обработка.addParser("test", обработка.matchiChar("б"));
	result = обработка.apply("олт", "test");
	Ожидаем.Что(result.state.column).Равно(1);
	Ожидаем.Что(result.state.pos).Равно(0);
	Ожидаем.Что(result.state.line).Равно(1);
	Ожидаем.Что(result.succes).Равно(ложь);
	
	
КонецПроцедуры

