#region tests
Перем КонтекстЯдра;
Перем Ожидаем;

Перем riki;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.НачатьГруппу("Проверка");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьПроверку");
	НаборТестов.НачатьГруппу("Простые парсеры");
	НаборТестов.Добавить("check_pos_char");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
	ФайлТеста = Новый Файл(ЭтотОбъект.ИспользуемоеИмяФайла);
	ФайлОбработки = ФайлТеста.Путь + "..\rikiPEG.epf";
	
	riki = ВнешниеОбработки.Создать(ФайлОбработки, Ложь);
	
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

#EndRegion

Процедура ТестДолжен_ВыполнитьПроверку() Экспорт
	
	Ожидаем.Что(riki.testCheck(),"Обработка корректно подключилась").Равно(1);
	
КонецПроцедуры

Процедура check_pos_char() Экспорт
	
	parser = riki.matchChar("z");
	grammar = riki.Grammar("start",parser);
	result = riki.parse("z", grammar );
	
	
	Ожидаем.Что(result.value,"Корректно прочли символ").Равно("z");
	Ожидаем.Что(result.position).Равно(2);
	//Ожидаем.Что(result.state.column).Равно(2);
	//Ожидаем.Что(result.state.line).Равно(1);
	Ожидаем.Что(result.type).Равно("success");
	
	
КонецПроцедуры
